In [6]:
import pandas as pd

data=pd.read_csv('weather_data_cities.csv', sep=',')

In [8]:
data[data['city']=='mumbai']

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [13]:
data[data['city'].str.upper() == "MUMBAI"]

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [14]:
pd.unique(data['day'])

array(['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017'], dtype=object)

In [17]:
data['city'].value_counts().reset_index()

       city  count
0  new york      4
1    mumbai      4
2     paris      4

In [18]:
data.sort_values(by='temperature',)

         day      city  temperature  windspeed   event
2   1/3/2017  new york           28         12    Snow
0   1/1/2017  new york           32          6    Rain
3   1/4/2017  new york           33          7   Sunny
1   1/2/2017  new york           36          7   Sunny
11  1/4/2017     paris           42         10  Cloudy
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
4   1/1/2017    mumbai           90          5   Sunny
7   1/4/2017    mumbai           92          5    Rain

In [23]:
marks= pd.read_csv('Marks.csv', sep='|')
marks

  Unnamed: 0   P   C   M
0          A  33  35  67
1          B  45  34  76
2          C   3  21  54
3          D  24  45  54

In [25]:
marks.sort_values(by='2',axis=1)

KeyError: '2'

In [26]:
#mean vlaue of temperature of city mumbai only
data[data['city']=='mumbai']['temperature'].mean()

np.float64(88.5)

In [29]:
for event in pd.unique(data['event']):
    print(event, data[data['event']==event]['windspeed'].mean())

Rain 5.5
Sunny 9.75
Snow 12.0
Fog 13.5
Cloudy 10.333333333333334

In [33]:
gdf= data.groupby(by='event')
for event,df in gdf:
    print(event)
    print(df)
    print()

Cloudy
         day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

Fog
        day    city  temperature  windspeed event
5  1/2/2017  mumbai           85         12   Fog
6  1/3/2017  mumbai           87         15   Fog

Rain
        day      city  temperature  windspeed event
0  1/1/2017  new york           32          6  Rain
7  1/4/2017    mumbai           92          5  Rain

Snow
        day      city  temperature  windspeed event
2  1/3/2017  new york           28         12  Snow

Sunny
        day      city  temperature  windspeed  event
1  1/2/2017  new york           36          7  Sunny
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny
8  1/1/2017     paris           45         20  Sunny

In [34]:
#use case of above code
gdf['windspeed'].mean()

event
Cloudy    10.333333
Fog       13.500000
Rain       5.500000
Snow      12.000000
Sunny      9.750000
Name: windspeed, dtype: float64

In [36]:
for df in gdf['windspeed']:
    print(df)
    print()

('Cloudy', 9     13
10     8
11    10
Name: windspeed, dtype: int64)

('Fog', 5    12
6    15
Name: windspeed, dtype: int64)

('Rain', 0    6
7    5
Name: windspeed, dtype: int64)

('Snow', 2    12
Name: windspeed, dtype: int64)

('Sunny', 1     7
3     7
4     5
8    20
Name: windspeed, dtype: int64)

In [38]:
gdf['windspeed'].count() #other functions are max, min

event
Cloudy    3
Fog       2
Rain      2
Snow      1
Sunny     4
Name: windspeed, dtype: int64

In [39]:
gdf['windspeed'].max() > 10

event
Cloudy     True
Fog        True
Rain      False
Snow       True
Sunny      True
Name: windspeed, dtype: bool

In [40]:
#pivot tables
#summarize and aggregate data
data

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [42]:
#2nd way and best way of grouping data
#usecases of pivot table (replacement of filtering)
data.pivot_table(index='city',columns='day', values='temperature')

day       1/1/2017  1/2/2017  1/3/2017  1/4/2017
city
mumbai        90.0      85.0      87.0      92.0
new york      32.0      36.0      28.0      33.0
paris         45.0      50.0      54.0      42.0

In [43]:
dpv=data.pivot_table(index='city',columns='day', values='temperature')

In [44]:
dpv.loc['mumbai','1/3/2017']

np.float64(87.0)

In [46]:
data.pivot_table(index='event',columns='day', values='windspeed')

day     1/1/2017  1/2/2017  1/3/2017  1/4/2017
event
Cloudy       NaN      13.0       8.0      10.0
Fog          NaN      12.0      15.0       NaN
Rain         6.0       NaN       NaN       5.0
Snow         NaN       NaN      12.0       NaN
Sunny       12.5       7.0       NaN       7.0

In [48]:
data.pivot_table(index='event',columns='city', values='windspeed',aggfunc='sum')

city    mumbai  new york  paris
event
Cloudy     NaN       NaN   31.0
Fog       27.0       NaN    NaN
Rain       5.0       6.0    NaN
Snow       NaN      12.0    NaN
Sunny      5.0      14.0   20.0

In [52]:
#concatenation
d1={
    'A':[10,20,30,40],
    'B':[3,4,5,6]
}
d2={
    'A':[30,40,50,60],
    'C':[3,4,5,6]
}

In [2]:
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2, index=[0,1,2,5])

NameError: name 'pd' is not defined

In [54]:
df1

    A  B
0  10  3
1  20  4
2  30  5
3  40  6

In [55]:
df2

    A  C
0  30  3
1  40  4
2  50  5
5  60  6

In [56]:
#vertical
df3=pd.concat([df1,df2])
df3

    A    B    C
0  10  3.0  NaN
1  20  4.0  NaN
2  30  5.0  NaN
3  40  6.0  NaN
0  30  NaN  3.0
1  40  NaN  4.0
2  50  NaN  5.0
5  60  NaN  6.0

In [57]:
#horizontal
df3=pd.concat([df1,df2], axis=1)
df3

      A    B     A    C
0  10.0  3.0  30.0  3.0
1  20.0  4.0  40.0  4.0
2  30.0  5.0  50.0  5.0
3  40.0  6.0   NaN  NaN
5   NaN  NaN  60.0  6.0

In [65]:
df3=pd.concat([df1,df2], join='inner', ignore_index=True)
df3

    A
0  10
1  20
2  30
3  40
4  30
5  40
6  50
7  60

In [61]:
df3=pd.concat([df1,df2], join='inner', axis=1) #common rows
df3

    A  B   A  C
0  10  3  30  3
1  20  4  40  4
2  30  5  50  5

In [66]:
#sql join
#by default inner join
mdf3= pd.merge(df1, df2, on= 'A', how= 'outer')
mdf3

    A    B    C
0  10  3.0  NaN
1  20  4.0  NaN
2  30  5.0  3.0
3  40  6.0  4.0
4  50  NaN  5.0
5  60  NaN  6.0

In [67]:
mdf3= pd.merge(df1, df2, on= 'A', how= 'left')
mdf3

    A  B    C
0  10  3  NaN
1  20  4  NaN
2  30  5  3.0
3  40  6  4.0

In [69]:
df1

    A  B
0  10  3
1  20  4
2  30  5
3  40  6

In [1]:
df1.apply(lambda x:x[0]+x[1])

NameError: name 'df1' is not defined

In [70]:
df1.apply(lambda x: x[0]+x[1], axis=1)

C:\Users\realme\AppData\Local\Temp\ipykernel_13672\2974777827.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df1.apply(lambda x: x[0]+x[1], axis=1)

0    13
1    24
2    35
3    46
dtype: int64

In [72]:
df1['A'].apply(float)

0    10.0
1    20.0
2    30.0
3    40.0
Name: A, dtype: float64

In [ ]:
#get dummies
#interpolation
#attempt assignment question